<footer class="company">
		<div class="wrappen stal_f">
					<div class="company_list">
						<?php /*Что-то добавить*/ ?>
					</div>
					<div class="company_list">
						<div class="doc_f">
							<span class="stal_doc">© Copyright 2004 — 2021 ООО «4ПАПАС».</span>
							<span class="stal_doc">115230, г. Москва, проезд Хлебозаводский, д. 7, строен.9, этаж 8, пом. XV, офис 801, комн.43</span>
							<span class="stal_doc">ОГРН: 1037736007627<!-- -->. &nbsp;<!-- -->ИНН: 7736231666</span>
							<span class="stal_doc">Возраст 6+<!-- -->. &nbsp;<!-- -->Все права защищены.</span>
						</div>
						<div class="icon-soc">
							<a class="icon-soc_item" href="https://vk.com/papajohnsru" target="_blank" rel="noopener noreferrer">
								<svg width="21" height="12" viewBox="0 0 21 12" xmlns="http://www.w3.org/2000/svg"><path d="M10.113 11.71h1.235s.373-.04.564-.245c.175-.188.17-.541.17-.541s-.024-1.653.745-1.897c.758-.24 1.732 1.598 2.765 2.305.78.534 1.373.417 1.373.417l2.76-.038s1.445-.09.76-1.221c-.056-.093-.399-.838-2.053-2.369-1.73-1.602-1.498-1.343.586-4.114 1.27-1.688 1.778-2.718 1.619-3.16-.151-.42-1.085-.309-1.085-.309l-3.108.02s-.23-.032-.401.07c-.167.1-.274.333-.274.333s-.492 1.306-1.148 2.416c-1.384 2.344-1.938 2.468-2.164 2.322-.526-.339-.395-1.362-.395-2.09 0-2.27.346-3.217-.672-3.463-.338-.08-.587-.135-1.45-.143C8.83-.01 7.891.006 7.36.266c-.353.172-.626.557-.46.58.206.026.67.124.917.459.319.432.308 1.403.308 1.403s.183 2.673-.428 3.005c-.419.228-.993-.237-2.227-2.363-.632-1.09-1.11-2.293-1.11-2.293S4.27.832 4.105.71A1.286 1.286 0 003.627.52L.674.54S.23.55.068.742c-.145.171-.012.525-.012.525s2.312 5.395 4.93 8.113c2.401 2.493 5.127 2.33 5.127 2.33" fill="currentColor" fill-rule="evenodd"></path></svg>
							</a>
							<a class="icon-soc_item" href="https://www.facebook.com/papajohnsru/" target="_blank" rel="noopener noreferrer">
								<svg width="9" height="17" viewBox="0 0 9 17" xmlns="http://www.w3.org/2000/svg"><path d="M8.117.003L6.094 0C3.82 0 2.352 1.535 2.352 3.912v1.803H.318A.321.321 0 000 6.04v2.614c0 .179.142.324.318.324h2.034v7.539c0 .179.143.324.318.324h2.654a.321.321 0 00.318-.324v-7.54h2.379a.321.321 0 00.318-.323V6.039a.328.328 0 00-.092-.229.315.315 0 00-.226-.095H5.642V4.186c0-.735.172-1.108 1.112-1.108h1.363a.321.321 0 00.317-.324V.327a.321.321 0 00-.317-.324z" fill="currentColor" fill-rule="evenodd"></path></svg>
							</a>
							<a class="icon-soc_item" href="https://www.instagram.com/papajohnsru/" target="_blank" rel="noopener noreferrer">
								<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 56.7 56.7" width="23" height="23"><g fill="currentColor"><path d="M28.2 16.7c-7 0-12.8 5.7-12.8 12.8s5.7 12.8 12.8 12.8S41 36.5 41 29.5s-5.8-12.8-12.8-12.8zm0 21c-4.5 0-8.2-3.7-8.2-8.2s3.7-8.2 8.2-8.2 8.2 3.7 8.2 8.2-3.7 8.2-8.2 8.2z"></path><circle cx="41.5" cy="16.4" r="2.9"></circle><path d="M49 8.9c-2.6-2.7-6.3-4.1-10.5-4.1H17.9c-8.7 0-14.5 5.8-14.5 14.5v20.5c0 4.3 1.4 8 4.2 10.7 2.7 2.6 6.3 3.9 10.4 3.9h20.4c4.3 0 7.9-1.4 10.5-3.9 2.7-2.6 4.1-6.3 4.1-10.6V19.3c0-4.2-1.4-7.8-4-10.4zm-.4 31c0 3.1-1.1 5.6-2.9 7.3s-4.3 2.6-7.3 2.6H18c-3 0-5.5-.9-7.3-2.6C8.9 45.4 8 42.9 8 39.8V19.3c0-3 .9-5.5 2.7-7.3 1.7-1.7 4.3-2.6 7.3-2.6h20.6c3 0 5.5.9 7.3 2.7 1.7 1.8 2.7 4.3 2.7 7.2v20.6z"></path></g></svg>
							</a>
						</div>
						<div class="politic">
							<a class="stal_p" href="#Политика">Политика обработки персональных данных</a>
						</div>
					</div>
		</div>
</footer>
<script src="https://unpkg.com/swiper@7/swiper-bundle.min.js"></script>
<script src="script.js"></script>