SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

CREATE DATABASE IF NOT EXISTS `mybase` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `mybase`;

DROP TABLE IF EXISTS `basket`;
CREATE TABLE `basket` (
  `id` int(20) NOT NULL,
  `image` text NOT NULL,
  `title` varchar(255) NOT NULL,
  `price` text DEFAULT NULL,
  `quantity` text NOT NULL,
  `amount` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `basket` (`id`, `image`, `title`, `price`, `quantity`, `amount`) VALUES
(2, 'pizza2.jpg', 'Итальянская с моцареллой и пепперони', '649', '2', '1298'),
(44, 'pizza1.jpg', 'Мясная', '499', '1', '499');

DROP TABLE IF EXISTS `menu_table`;
CREATE TABLE `menu_table` (
  `id` int(20) NOT NULL,
  `image` text NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `size` text NOT NULL,
  `price` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `menu_table` (`id`, `image`, `title`, `content`, `size`, `price`) VALUES
(1, 'pizza1.jpg', 'Мясная', 'Супермясная пицца с пикантной пепперони, ветчиной, хрустящим беконом, ароматной свининой, Моцареллой и фирменным томатным соусом. С пикантной остринкой', '[\"23\",\"30\",\"35\",\"40\"]', '[\"499\",\"759\",\"899\",\"1059\"]'),
(2, 'pizza2.jpg', 'Итальянская с моцареллой и пепперони', 'Традиционный рецепт с двумя видами сыра: тертый и мягкий сыр Моцарелла; пикантная пепперони, шампиньоны и смесь приправ', '[\"23\",\"30\",\"35\",\"40\"]', '[\"419\",\"649\",\"799\",\"979\"]'),
(3, 'pizza3.jpg', 'Маргарита', 'Традиционный рецепт пиццы с Моцареллой, сочными томатами, фирменным томатным соусом и орегано', '[\"23\",\"30\",\"35\",\"40\"]', '[\"399\",\"539\",\"719\",\"919\"]'),
(4, 'appetizer1.jpg', 'Сырные палочки с блю чиз', 'Любимая закуска теперь с сыром блю чиз!', '[\"23\",\"30\",\"35\",\"40\"]', '[\"369\",\"\",\"\",\"\"]'),
(5, 'appetizer2.jpg', 'Сырные палочки', 'Любимая закуска с Моцареллой и соусом \"Особый чесночный\"', '[\"23\",\"30\",\"35\",\"40\"]', '[\"349\",\"\",\"\",\"\"]'),
(6, 'appetizer3.jpg', 'Сырные палочки с ветчиной и грибами', 'Любимая закуска с Моцареллой, ароматной ветчиной, шампиньонами и соусом \"Особый чесночный\"', '[\"23\",\"30\",\"35\",\"40\"]', '[\"249\",\"\",\"\",\"\"]'),
(7, 'drink1.jpg', 'Пиво Bud безалкогольное', '', '[\"23\",\"30\",\"35\",\"40\"]', '[\"129\",\"\",\"\",\"\"]'),
(8, 'drink2.jpg', 'Pepsi', '', '[\"23\",\"30\",\"35\",\"40\"]', '[\"99\",\"\",\"\",\"\"]'),
(9, 'drink3.jpg', 'Сок \"Я\" Апельсиновый', '', '[\"23\",\"30\",\"35\",\"40\"]', '[\"199\",\"\",\"\",\"\"]'),
(10, 'sauce1.jpg', 'Мед цветочный', '', '[\"23\",\"30\",\"35\",\"40\"]', '[\"49\",\"\",\"\",\"\"]'),
(11, 'sauce2.jpg', 'Барбекью', '', '[\"23\",\"30\",\"35\",\"40\"]', '[\"49\",\"\",\"\",\"\"]'),
(12, 'sauce3.jpg', 'Особый Чесночный', '', '[\"23\",\"30\",\"35\",\"40\"]', '[\"59\",\"\",\"\",\"\"]'),
(13, 'dessert1.jpg', 'Узелки сладкие', 'Мягкие булочки с корицей и сахарной пудрой', '[\"23\",\"30\",\"35\",\"40\"]', '[\"149\",\"\",\"\",\"\"]'),
(14, 'dessert2.jpg', 'Рогалики с клубникой', 'Сладкие рогалики с клубникой, сыром \"кремчиз\" и сахарной пудрой с соусом на выбор', '[\"23\",\"30\",\"35\",\"40\"]', '[\"199\",\"\",\"\",\"\"]'),
(15, 'dessert3.jpg', 'Сырники', 'Нежные сырники из печи с соусом на выбор', '[\"23\",\"30\",\"35\",\"40\"]', '[\"159\",\"\",\"\",\"\"]'),
(16, 'hot1.jpg', 'Картофель с ветчиной и грибами', 'Запеченные дольки картофеля с ветчиной, шампиньонами, сыром Моцарелла и соусом Чесночный Рэнч', '[\"23\",\"30\",\"35\",\"40\"]', '[\"219\",\"\",\"\",\"\"]'),
(17, 'hot2.jpg', 'Картофель с беконом и халапеньо', 'Запеченные дольки картофеля с беконом, сыром Моцарелла, фирменным томатным соусом и жгучим перцем \"Халапеньо\"', '[\"23\",\"30\",\"35\",\"40\"]', '[\"219\",\"\",\"\",\"\"]'),
(18, 'hot3.jpg', 'Картофель по-баварски', 'Запеченные дольки картофеля с альпийскими колбасками, маринованными огурчиками, сыром, луком и соусом барбекю', '[\"23\",\"30\",\"35\",\"40\"]', '[\"219\",\"\",\"\",\"\"]'),
(19, 'combo1.jpg', 'Липтон сет', '\"Пепперони\" 30 см, \"Мексиканская\" 30 см, Липтон Айс Ти Лимонный 0,5 л', '[\"23\",\"30\",\"35\",\"40\"]', '[\"1019\",\"\",\"\",\"\"]'),
(20, 'combo2.jpg', 'Сытный cет', 'Пиццы 35 см: \"Мясная\", \"Чизбургер\", \"Большая Бонанза\", \"Супер Папа\"', '[\"23\",\"30\",\"35\",\"40\"]', '[\"2499\",\"\",\"\",\"\"]'),
(21, 'combo3.jpg', 'Мясной сет', '\"Супер Папа\" 23 см, \"Мясная\" 23 см, Pepsi 2 л', '[\"23\",\"30\",\"35\",\"40\"]', '[\"999\",\"\",\"\",\"\"]'),
(22, 'vegan1.jpg', 'Веганская', 'Легкая пицца с фирменным томатным соусом и веганской Моцареллой', '[\"23\",\"30\",\"35\",\"40\"]', '[\"499\",\"799\",\"959\",\"1079\"]'),
(23, 'vegan2.jpg', 'Веганская с овощами', 'Фирменный томатный соус, веганская Моцарелла, сладкий зелёный перец, шампиньоны, маслины, лук и сочные томаты', '[\"23\",\"30\",\"35\",\"40\"]', '[\"499\",\"799\",\"959\",\"1079\"]'),
(24, 'vegan3.jpg', 'Веганская Маргарита', 'Традиционный рецепт пиццы с веганской Моцареллой, сочными томатами, фирменным томатным соусом и орегано', '[\"23\",\"30\",\"35\",\"40\"]', '[\"499\",\"799\",\"959\",\"1079\"]');


ALTER TABLE `basket`
  ADD PRIMARY KEY (`id`);

ALTER TABLE `menu_table`
  ADD PRIMARY KEY (`id`);


ALTER TABLE `basket`
  MODIFY `id` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

ALTER TABLE `menu_table`
  MODIFY `id` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
